<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [143]:
import pandas as pd
import psycopg2

In [144]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python

In [145]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [146]:
# текст запроса
query = f'''select --* 
            id as id
            FROM vacancies         
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\1671484069.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

             id
0      55312386
1      55843014
2      54525964
3      54525965
4      55354053
...         ...
49192  55589514
49193  55029668
49194  66172263
49195  66180086
49196  55547842

[49197 rows x 1 columns]

In [22]:
# результат запроса
'''
49197

'''

49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [147]:
# текст запроса
query = f'''select --* 
                id as id
            FROM employers            
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\651438623.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            id
0         2393
1        72977
2         3155
3          675
4      1840010
...        ...
23496  1441774
23497  4718575
23498  3702770
23499  5636092
23500  2064382

[23501 rows x 1 columns]

In [24]:
# результат запроса
'''

23501

'''

23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [150]:
# текст запроса
query = f'''select --* 
                id as id
            FROM areas            
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\2441520220.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

        id
0     2758
1        8
2     1180
3     1240
4        2
...    ...
1357  5043
1358  3934
1359  4825
1360  3708
1361  2432

[1362 rows x 1 columns]

In [ ]:
# результат запроса
'''

1362

'''

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [39]:
# текст запроса
query = f'''select --* 
                id as id
            FROM industries            
         '''
df = pd.read_sql_query(query, connection)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_14052\1398257758.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

          id
0      7.540
1      7.539
2     27.550
3     27.551
4     13.664
..       ...
289   37.626
290   42.603
291   29.532
292   37.627
293  388.505

[294 rows x 1 columns]

In [28]:
# результат запроса
'''

294

'''

294

***

In [29]:
# выводы по предварительному анализу данных
'''
  База данных Head Hunter содержит 49197 вакансий:
  от 23501 работодателей, в 1362 регионах и
  в 294 отраслях.
 
'''

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [64]:
# текст запроса
query = f''' 
          select a.name area, count(v.name) cnt
          from areas a
          join vacancies v on a.id = v.area_id
          group by area
          order by cnt desc
          limit 5




'''
    
df = pd.read_sql_query(query, connection)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\3916884833.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

In [31]:
# результат запроса
'''

Москва, Санкт-Петербург, Минск, Новосибирск, Алматы

'''

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [28]:
# текст запроса

query = f''' SELECT id
FROM 
    vacancies
WHERE (salary_from >= 1 OR salary_to >=1)   ''' 

df = pd.read_sql_query(query, connection)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_6552\793437235.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

             id
0      55312386
1      55354053
2      55050261
3      55583432
4      55471342
...         ...
24068  55874997
24069  55291789
24070  51883918
24071  66172263
24072  66180086

[24073 rows x 1 columns]

In [33]:
# результат запроса
'''

24073

'''

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [73]:
# текст запроса

query = f''' 
SELECT round(avg(v.salary_to)) as up_salary, round(avg(v.salary_from)) as low_salary 
        FROM VACANCIES v
        '''
df = pd.read_sql_query(query, connection)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_14052\3498168529.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   up_salary  low_salary
0   110537.0     71065.0

In [35]:
# результат запроса
'''
up_salary	low_salary
110537.0	71065.0

'''

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [78]:
# текст запроса
query = f''' 
          select v.schedule schedule, v.employment, count(v.id)
          from vacancies v
          --where (v.salary_from IS NOT NULL) OR (v.salary_to IS NOT NULL)
          --join vacancies v on a.id = v.area_id
          group by schedule, employment
          order by 3 DESC
         limit 5


''' 

df = pd.read_sql_query(query, connection)
df

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\3642033369.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           schedule           employment  count
0       Полный день     Полная занятость  35367
1  Удаленная работа     Полная занятость   7802
2     Гибкий график     Полная занятость   1593
3  Удаленная работа  Частичная занятость   1312
4    Сменный график     Полная занятость    940

In [37]:
# результат запроса
''' 

Удаленная работа	Полная занятость	7802

'''

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [89]:
# текст запроса

query = f'''
          select v.experience, count(v.id)
          from vacancies v
          --where (v.salary_from IS NOT NULL) OR (v.salary_to IS NOT NULL)
          --join vacancies v on a.id = v.area_id
          group by experience
          order by 2
          limit 5
        '''
df = pd.read_sql_query(query, connection)
display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\2975549223.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

In [39]:
# результат запроса
'''

Более 6 лет — Нет опыта — От 3 до 6 лет — От 1 года до 3 лет

'''

***

In [40]:
# выводы по детальному анализу вакансий

'''
  Есть прямая взаимосвязь между количеством жителей в регионе 
  и числом вакансий в оном (больше жителей - больше вакансий).
  Работодатели желают получить сотрудников на полный рабочий день, учитывая вариант с удаленкой. 
  Средняя зп,  в районе 100к руб.
  Требования по опыту, чаще всего, это от 1 года до 3 лет.

'''

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [93]:
# текст запроса
query = f'''
          select e.name company,  count(v.id)
          from vacancies v
          --where (v.salary_from IS NOT NULL) OR (v.salary_to IS NOT NULL)
          join employers e on v.employer_id = e.id
          group by company
          order by 2 DESC
          limit 10
        '''
df = pd.read_sql_query(query, connection)

display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\2304451544.py:13: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                 company  count
0                 Яндекс   1933
1             Ростелеком    491
2               Тинькофф    444
3                   СБЕР    428
4          Газпром нефть    331
5            ИК СИБИНТЕК    327
6                    МТС    292
7                DataArt    247
8  Совкомбанк Технологии    204
9             Первый Бит    176

In [42]:
# результат запроса
'''
Яндекс — Газпром нефть

'''

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [96]:
# текст запроса
query = f'''
          select a.name area, count(DISTINCT v.id) vacation, count(distinct e.id) company
          from areas a
          left join vacancies v on a.id = v.area_id
          left join employers e on a.id = e.area
          where v.area_id is null

          --where e.name IS NULL
          group by a.name
          --having count(v.name)=0 -- OR (v.salary_to IS NOT NULL)
          order by  3 desc
          limit 10
        '''
df = pd.read_sql_query(query, connection)

display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\1949867371.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                    area  vacation  company
0                 Россия         0      410
1              Казахстан         0      207
2     Московская область         0       75
3     Краснодарский край         0       19
4               Беларусь         0       18
5     Ростовская область         0       18
6            Азербайджан         0       17
7  Нижегородская область         0       16
8   Республика Татарстан         0       16
9             Узбекистан         0       15

In [44]:
# результат запроса
'''

Россия

'''

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [98]:
# текст запроса

# текст запроса
query = f'''
          select e.name "Название компании", count(DISTINCT v.area_id) "Число регионов"--company, count(v.name) "Количество вакансий"-- vacancie
          from employers e
          --from vacancies v
          join vacancies v on e.id = v.employer_id
          --join areas a on v.area_id = a.id

          --where v.salary_to IS NULL

          group by e.name
          --having count(v.name)=0 -- OR (v.salary_to IS NOT NULL)
          order by 2 desc
          --limit 6
          '''
df = pd.read_sql_query(query, connection)

display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\26795161.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            Название компании  Число регионов
0                      Яндекс             181
1                  Ростелеком             152
2                  Спецремонт             116
3      Поляков Денис Иванович              88
4                   ООО ЕФИН               71
...                       ...             ...
14761                  UniSol               1
14762            UNISTORY LLC               1
14763                   UNIT6               1
14764     United Distribution               1
14765              UNITEL LLC               1

[14766 rows x 2 columns]

In [46]:
# результат запроса
'''

181

'''

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [104]:
# текст запроса

query = f'''
          select *--a.name area, count(DISTINCT v.id) vacation, count(distinct e.id) company
          from employers e
          --from employers_industries ei
          left join employers_industries ei on e.id = ei.employer_id
          --left join employers e on a.id = e.area
          where ei.employer_id is null

          --where e.name IS NULL
          --group by a.name
          --having count(v.name)=0 -- OR (v.salary_to IS NOT NULL)
          order by  1 desc
          --limit 6
        '''
df = pd.read_sql_query(query, connection)

display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\2333058435.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           id                               name  area employer_id industry_id
0     8906189              Ходыч Роман Сергеевич  1955        None        None
1     8905803                         Ультра 100  1512        None        None
2     8904282   Центр Цифровых Технологий - МФТИ     1        None        None
3     8903831                        EasyDrive24    24        None        None
4     8903436  Kiber One, школа программирования    51        None        None
...       ...                                ...   ...         ...         ...
8414     3204                             ГК ТСС     1        None        None
8415     2053                  ФПК Гарант-Инвест     1        None        None
8416     1811                           Упаковка     1        None        None
8417     1304                             Luxoft     1        None        None
8418      960                                ОМС     1        None        None

[8419 rows x 5 columns]

In [48]:
# результат запроса
'''

8419

'''

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [105]:
# текст запроса

query = f'''
          select e.name area, count(DISTINCT ei.industry_id) industries--, count(distinct e.id) company
          from employers e
          --from employers_industries ei
          left join employers_industries ei on e.id = ei.employer_id
          --left join employers e on a.id = e.area
          --where ei.employer_id is null

          --where e.name IS NULL
          group by e.name
          having count(DISTINCT ei.industry_id) = 4
          order by  1
          --limit 6
        '''
df = pd.read_sql_query(query, connection)

display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\1393999977.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                 area  industries
0        101 Интернет           4
1            21vek.by           4
2                2ГИС           4
3                  2К           4
4         4 пикселя +           4
...               ...         ...
1127            ЮРИОН           4
1128  ЮТИП Технологии           4
1129           ЯКласс           4
1130            ЯрНео           4
1131    Яшин&Партнёры           4

[1132 rows x 2 columns]

In [50]:
# результат запроса
'''

2ГИС

'''

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [106]:
# текст запроса

query = f'''
          select *--e.name area, count(DISTINCT ei.industry_id) industries--, count(distinct e.id) company
          from employers e
          --from employers_industries ei
          left join employers_industries ei on e.id = ei.employer_id
          left join industries i on ei.industry_id = i.id
          where i.name = 'Разработка программного обеспечения'--) and (e.name IS NULL)
          --group by e.name
          --having count(DISTINCT ei.industry_id) = 4
          order by  1
          --limit 6
        '''
df = pd.read_sql_query(query, connection)

display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\1173901950.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

,id,name,area,employer_id,industry_id,id,name
0,25,Deutsche Telekom IT Solutions,2,25,7.540,7.540,Разработка программного обеспечения
1,115,Ай-Теко (I-Teco),1,115,7.540,7.540,Разработка программного обеспечения
2,139,IBS,1,139,7.540,7.540,Разработка программного обеспечения
3,154,Diasoft,1,154,7.540,7.540,Разработка программного обеспечения
4,172,1C-Рарус,1,172,7.540,7.540,Разработка программного обеспечения
...,...,...,...,...,...,...,...
3548,8891186,Skynet.kz,160,8891186,7.540,7.540,Разработка программного обеспечения
3549,8892103,Коваленко Сергей Андреевич,92,8892103,7.540,7.540,Разработка программного обеспечения
3550,8897248,VoltoTech,2759,8897248,7.540,7.540,Разработка программного обеспечения
3551,8900115,SOFTWARE WIZARDS,2759,8900115,7.540,7.540,Разработка программного обеспечения
3552,8906438,MergeUnit,2758,8906438,7.540,7.540,Разработка программного обеспечения

In [52]:
# результат запроса
'''

3553

'''

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [107]:
# код для получения списка городов-милионников

'''
  Вытаскиваем список городов-миллионников России парсингом со страницы WikPedia
'''
import requests # Импортируем библиотеку requests
from bs4 import BeautifulSoup # Импортируем библиотеку BeautifulSoup
# from pprint import pprint # Импортируем функцию pprint()
# import codecs
# сначала открываем страницу Wikipedia, проверяем статус
url = 'https://ru.wikipedia.org/wiki/Города-миллионеры_России' # Определяем значение URL страницы для запроса
response = requests.get(url) # Делаем GET-запрос к ресурсу и результат ответа сохраняем в переменной response
print(response.status_code, 'Значит, всё открылось нормально\n')
#print(response.text)
# дальше работа с содержимым страницы
page = BeautifulSoup(response.text, 'html.parser') # Создаём объект BeautifulSoup, указывая html-парсер
print(page.title.text,'\n')                        # Выводим текст из полученного тега, который содержится в атрибуте text
tabl = page.find("table", class_="standard")       # ищем на странице таблицу

town = []
tt = tabl.find("tbody") # в таблице выбираем тело таблицы
qq = tt.find_all("tr")  # в теле таблицы выбираем все ряды

for ss in qq:
  qqq = list(ss.find("a"))  # в каждом ряде находим тег "а", преобразуем его в список
  town.append(qqq[0])       # и добавляем содержимое к списку городов
town = town[1:]             # в первом ряду кусок от названия, отсекаем его
print(town)

200 Значит, всё открылось нормально

Города-миллионеры России — Википедия

['Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Красноярск', 'Челябинск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Краснодар', 'Омск', 'Воронеж', 'Пермь', 'Волгоград']

In [113]:
# текст запроса

# сипользую список городов миллионников, формирую строку str для Where с его помощью
# я выбрал такой способ формирования запроса, потому что для меня довольно очевидно,
# что городов миллионников по определению не так много.
# Второй вариант, который, вероятно, предполагался - в предыдущем блоке сохранить результат выборки
# городов миллионников в виде отдельного файла в формате SQL, и далее запрос с использованием
# SQL запроса, с фильтрацией по признаку is not null после присоединения соответствующей таблицы

# формируем начало запроса
query = f'''
          (select a.name area, count(v.id) count -- count(DISTINCT ei.industry_id) industries--, count(distinct e.id) company
          from employers e
          join vacancies v on e.id = v.employer_id
          join areas a on v.area_id = a.id
          where (e.name = 'Яндекс')'''
# далее формируем строку для фильтрации городов миллионников из предыдущего блока
# в результате которого получили список городов миллионников
ll = len(town)
if ll > 0:
  str = f" AND (( a.name = '{town[0]}')" # если есть хоть один город миллионник
  if ll > 1:
    for s in town[1:]:
      str += f" OR (a.name = '{s}')"     # и для каждого следующего города из списка
print(str)                               # контролируем
                                         # далее завершение запроса
query += (str + f''')
          group by a.name
          order by  2 desc)
          '''
          +                             # далее суммирем результат
'''
          --limit 6
          union  all
          select 'Total :' area, count( v.id)
          from employers e
          join vacancies v on e.id = v.employer_id
          join areas a on v.area_id = a.id
          where (e.name = 'Яндекс')'''
          +str
          +
'''       )
          group by area
          order by  2
'''
)
df = pd.read_sql_query(query, connection)
display(df)

 AND (( a.name = 'Москва') OR (a.name = 'Санкт-Петербург') OR (a.name = 'Новосибирск') OR (a.name = 'Екатеринбург') OR (a.name = 'Казань') OR (a.name = 'Нижний Новгород') OR (a.name = 'Красноярск') OR (a.name = 'Челябинск') OR (a.name = 'Самара') OR (a.name = 'Уфа') OR (a.name = 'Ростов-на-Дону') OR (a.name = 'Краснодар') OR (a.name = 'Омск') OR (a.name = 'Воронеж') OR (a.name = 'Пермь') OR (a.name = 'Волгоград')

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\2056707140.py:47: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

               area  count
0              Омск     21
1         Челябинск     22
2        Красноярск     23
3         Волгоград     24
4            Казань     25
5    Ростов-на-Дону     25
6             Пермь     25
7            Самара     26
8               Уфа     26
9         Краснодар     30
10          Воронеж     32
11      Новосибирск     35
12  Нижний Новгород     36
13     Екатеринбург     39
14  Санкт-Петербург     42
15           Москва     54
16          Total :    485

In [55]:
# результат запроса
'''

Количество строк - 17
Результат строки Total - 485

'''

***

In [56]:
# выводы по анализу работодателей
'''
По количеству вакансий лидируют крупнейшие компании:
0   Яндекс	1933,
1	Ростелеком	491
2	Тинькофф	444
3	СБЕР	428
4	Газпром нефть	331
Они предлагают вакансии в самых разных регионах, в первую очередь в городах - миллионниках

'''

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [118]:
# текст запроса

query = f'''
          select count(v.id)--, e.name--, v.name
          from vacancies v
          where  (v.name iLIKE '%data%') OR  (v.name iLIKE '%данн%')
          --AND (NOT (v.name  ilike '%junior%')  OR (v.employment ilike '%Стажировка%') OR (v.experience ilike '%Нет опыта%'))
          order by  1
        '''
df = pd.read_sql_query(query, connection)

display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\4196811611.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1771

In [58]:
# результат запроса
'''

1771

'''

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [119]:
# текст запроса

query = f'''
select
    count(v.name)

from vacancies v

WHERE
(
    (name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name ILIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)

    AND (v.name ILIKE '%junior%'
    OR v.experience ILIKE '%Нет опыта%'
    OR v.employment ILIKE '%Стажировка%')
        '''

df = pd.read_sql_query(query, connection)
#print(query, f'\n Всего найдено {df.shape[0]} вакансий, содержащих data или данн')
display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\2144560610.py:23: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0     51

In [60]:
# результат запроса
'''

51

'''

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [122]:
# текст запроса

query = f'''
select --*
     v.id, v.key_skills
   --count(v.id)

from vacancies v

WHERE ( (v.key_skills like '%SQL%')
        or
        (v.key_skills ilike '%postgres%')
        )
    AND
(
    (name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name ILIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)
  --AND (NOT (v.name  ilike '%junior%')  OR (v.employment ilike '%Стажировка%') OR (v.experience ilike '%Нет опыта%'))
    order by 1
    '''
df = pd.read_sql_query(query, connection)
print(df.shape[0]) 
display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\1621276841.py:25: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

229

           id                                         key_skills
0    48838707  Git\tSpring Framework\tJava\tPostgreSQL\tApach...
1    49930707  Linux\tPostgreSQL\tSQL\tPython\tJava\tPHP\tPer...
2    50533416          Python\tSQL\tРабота в команде\tOpenCV\tML
3    51001456          Python\tGit\tLinux\tSQL\tBig Data\tGolang
4    51834014  JavaScript\tMySQL\tОбучение и развитие\tУправл...
..        ...                                                ...
224  66134973  MS PowerPoint\tPython\tSQL\tПодготовка презент...
225  66142163  SQL\tMS SQL\tУдаленная работа\tPython\tМатемат...
226  66176514  Python\tJavaScript\tDjango Framework\tReact\tM...
227  66178607  Python\tPostgreSQL\tPyTorch\tTensorflow\tPanda...
228  66185427  Python\tLinux\tАнализ данных\tKeras\tData Scie...

[229 rows x 2 columns]

In [62]:
# результат запроса
'''

229

'''

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [141]:
# текст запроса
query = f'''select
    --DISTINCT
     v.id, v.key_skills
    -- count(v.name)

from vacancies v

WHERE
(v.key_skills ilike '%Python%')
AND
(   (name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name LIKE '%ML%') AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)
    '''
df = pd.read_sql_query(query, connection)

display(df)

print(f'Python используется в качестве ключевого навыка в\n{df.shape[0]} запросах')

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\2767092538.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           id                                         key_skills
0    50533416          Python\tSQL\tРабота в команде\tOpenCV\tML
1    54824572  Oracle Pl/SQL\tБазы данных\tMachine Learning\t...
2    54825318  Python\tOpenCV\tTensorflow\tComputer Vision\tН...
3    66120847                     Python\tFlask\tLinux\tAWS\tGit
4    55351147   Python\tSQL\tNLP\tScikit-learn\tMachine Learning
..        ...                                                ...
346  55478561  Python\tLinux\tSQL\tPyTorch\tOpenCV\tKeras\tCa...
347  55306481  Python\tАналитическое мышление\tАнализ данных\...
348  54918116  Python\tNumpy\tPyTorch\tPandas\tМатематический...
349  55185186           Python\tScikit-learn\tPandas\tGit\tNumpy
350  55311099  Python\tLinux\tKubernetes\tAWS\tGit\tPeople Ma...

[351 rows x 2 columns]

Python используется в качестве ключевого навыка в
351 запросах

In [64]:
# результат запроса
'''
351

'''
# у меня получился ответ 351, хотя правильный 357...

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [125]:
# текст запроса

query = f'''select
round(avg(length(key_skills) - length(replace(key_skills,CHR(9),''))+1),2)

from vacancies v

WHERE
(
       (v.name ILIKE '%data scientist%')
    OR (lower(v.name) ILIKE '%data science%')
    OR (v.name ILIKE '%исследователь данных%')
    OR (v.name  LIKE '%ML%' AND  (v.name NOT iLIKE '%html%'))
    OR (v.name ILIKE '%machine learning%')
    OR (v.name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)
    '''
df = pd.read_sql_query(query, connection)

display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\1157869382.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   round
0   6.41

In [66]:
# результат запроса
'''
6.41

'''

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [133]:
# текст запроса

query = f'''select
  v.experience, ROUND(AVG(coalesce((v.salary_from + v.salary_to) / 2, v.salary_from, v.salary_to)), 0)

from vacancies v

WHERE
(
       (v.name ILIKE '%data scientist%')
    OR (lower(v.name) ILIKE '%data science%')
    OR (v.name ILIKE '%исследователь данных%')
    OR (v.name  LIKE '%ML%' AND  (v.name NOT iLIKE '%html%'))
    OR (v.name ILIKE '%machine learning%')
    OR (v.name ILIKE '%машинн%обучен%')
    AND (key_skills IS NOT NULL)
)

GROUP BY v.experience
ORDER BY 2 DESC
    '''
df = pd.read_sql_query(query, connection)

display(df)

C:\Users\USER\AppData\Local\Temp\ipykernel_7752\97743878.py:22: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience     round
0         Более 6 лет       NaN
1       От 3 до 6 лет  243115.0
2  От 1 года до 3 лет  145236.0
3           Нет опыта   74643.0

In [68]:
# результат запроса
'''

243115

'''

***

In [69]:
# выводы по предметному анализу
'''
Среди большого разнообразия данных можно найти и вакансии по специальности Data Science.
Многие специализации требуют знания Python и SQL.
Специалистам с опытом от 3 до 6 лет предлагается в среднем зарплата более 240 тысяч,
с опытом от 1 года до 3 лет более 140 тысяч.

'''

# Общий вывод по проекту

In [70]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, 
# сделать прогнозы, продумать варианты продолжения исследования
'''
Компания Head Hunter занимает ведущую позицию на рынке труда, как для соискателей так и для работодателей.
Хорошо структурированная база данных с удобными сервисами, плюс внимание к деталям и постоянное развитие.

'''